// ============================================================
// УРОК 4 - Події, DOMContentLoaded, IntersectionObserver
// ============================================================

// Задача №1
// Дано в html: три елементи з класом 'item'.
// При кліку на кожен з елементів треба додавати клас 'active', 
// а при повторному кліку - прибирати цей клас.

function task1() {
	// ваш код тут

}


// Задача №2
// Дано елемент з класом 'card', який спочатку прозорий (opacity: 0).
// Дано кнопку з класом 'show-card-btn'.
// При кліку на цю кнопку треба додати елементу .card клас 'loaded'
// (який прибирає прозорість - opacity: 1).

function task2() {
	// ваш код тут

}



// Задача №3
// Дано в html: header main footer
// При наведенні курсору на header треба змінити фон у footer.
// При виході курсору з header треба повернути початковий фон footer.

function task3() {
	// ваш код тут

}


// Задача №4
// Дано в HTML елемент з класом '.counter-item', що має такі data-атрибути:
//   data-delay="1000" - затримка між числами (мс)
//   data-max="20" - до якого числа рахувати
// Вам треба створити функцію, яка будує інтервал що буде змінювати контент в елементі з класом '.counter-item' 
// виводячи цифру, яка збільшується на одиницю: 1 2 3 ... і т.д.з таким інтервалом, який вказаний в data-delay.
// Рахунок має починатися, коли елемент стає видимим на екрані (IntersectionObserver).
// Рахунок має зупинятися, коли досягає числа, вказаного в data-max.
// Інтервал не повинен запускатися повторно при повторному появленні елемента на екрані.

function task4() {
	// ваш код тут

}


// Не чіпати - потрібно і для тестів, і для браузера
if (typeof module !== 'undefined') module.exports = { task1, task2, task3, task4 };
export { task1, task2, task3, task4 };
